outputs/aws/loadbalancer/nginx/20000/ab_metrics4.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.29.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   16.791 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5900000 bytes
HTML transferred:       480000 bytes
Requests per second:    1191.10 [#/sec] (mean)
Time per request:       8.396 [ms] (mean)
Time per request:       0.840 [ms] (mean, across all concurrent requests)
Transfer rate:          343.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       6
Processing:     1    8   2.8      8      27
Waiting:        0    8   2.8      8      26
Total:          1    8   2.8      8      28

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     10
  90%     12
  95%     13
  98%     15
  99%     17
 100%     28 (longest request)